src/InformationRegisters/ЖурналЗапускаСкриптов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЗапускаСкриптов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПустойЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кс_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скрипт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_Скрипты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЖурналЗапускаСкриптов/Ext/ManagerModule.bsl
Процедура СоздатьЗаписьЗапускаСкрипта(Сценарий,Скрипт,Начало,Конец,СодержаниеЛога) Экспорт
	//логирование
	ЖурналОбновлений = РегистрыСведений.ЖурналЗапускаСкриптов.СоздатьМенеджерЗаписи();
	ЖурналОбновлений.НачалоПериод = Начало;
	ЖурналОбновлений.КонецПериод = Конец;
	ЖурналОбновлений.Сценарий = Сценарий;
	ЖурналОбновлений.Скрипт = Скрипт;
	ЖурналОбновлений.Результат = СодержаниеЛога;   
	ЖурналОбновлений.Записать(Истина);	
КонецПроцедуры
